In [39]:
import pandas as pd 
my_dict = { 'country' : ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt'],
            'drives_right' :[True, False, False, False, True, True, True] ,
            'cars_per_cap' : [809, 731, 588, 18, 200, 70, 45]
            }

In [40]:
print(my_dict)

{'country': ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt'], 'drives_right': [True, False, False, False, True, True, True], 'cars_per_cap': [809, 731, 588, 18, 200, 70, 45]}

In [41]:
cars = pd.DataFrame(my_dict)
print(cars)

         country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

In [42]:
row_labels = ['US', 'AUS', 'JAP', 'IN', 'RU', 'MOR', 'EG']
cars.index = row_labels

In [43]:
print(cars)

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

In [44]:
country = cars['country']
print(country)
print(type(country))        

country2 = cars[['country']]
print(country2)
print(type(country2))

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object
<class 'pandas.core.series.Series'>
           country
US   United States
AUS      Australia
JAP          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt
<class 'pandas.core.frame.DataFrame'>

In [45]:
cars.loc['IN']

country         India
drives_right    False
cars_per_cap       18
Name: IN, dtype: object

In [46]:
cars.loc[['IN']]

   country  drives_right  cars_per_cap
IN   India         False            18

In [47]:
cars.loc[['US','AUS'],['country','drivers_right']]

/home/prajaygujarathi/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

           country  drivers_right
US   United States            NaN
AUS      Australia            NaN

In [48]:
cars = cars.fillna(0)

In [49]:
cars.loc[ :, ['country','drives_right']]

           country  drives_right
US   United States          True
AUS      Australia         False
JAP          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

In [50]:
cars.loc[['US']]

          country  drives_right  cars_per_cap
US  United States          True           809

In [51]:
# Extract drives_right column as Series: dr
dr = cars['drives_right']

In [52]:
#subsetting dataframe
sel = cars[dr]

In [53]:
print(sel)

           country  drives_right  cars_per_cap
US   United States          True           809
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

In [54]:
# or sel = cars[cars['drives_right']]

In [55]:
cars

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

In [56]:
#adds a column with no of terms in each of the row in column 'country'
for label, row in cars.iterrows():
    cars.loc[label,'name_len'] = len(row['country'])
cars

           country  drives_right  cars_per_cap  name_len
US   United States          True           809      13.0
AUS      Australia         False           731       9.0
JAP          Japan         False           588       5.0
IN           India         False            18       5.0
RU          Russia          True           200       6.0
MOR        Morocco          True            70       7.0
EG           Egypt          True            45       5.0

In [57]:
cars['name_len'] = cars['country'].apply(len)

In [58]:
cars

           country  drives_right  cars_per_cap  name_len
US   United States          True           809        13
AUS      Australia         False           731         9
JAP          Japan         False           588         5
IN           India         False            18         5
RU          Russia          True           200         6
MOR        Morocco          True            70         7
EG           Egypt          True            45         5

In [59]:
cars.columns

Index(['country', 'drives_right', 'cars_per_cap', 'name_len'], dtype='object')

In [60]:
cars['my new column'] = 'default value'

In [61]:
cars

           country  drives_right  cars_per_cap  name_len  my new column
US   United States          True           809        13  default value
AUS      Australia         False           731         9  default value
JAP          Japan         False           588         5  default value
IN           India         False            18         5  default value
RU          Russia          True           200         6  default value
MOR        Morocco          True            70         7  default value
EG           Egypt          True            45         5  default value

In [62]:
cars.drop('my new column', axis = 1, inplace = True)

In [63]:
cars

           country  drives_right  cars_per_cap  name_len
US   United States          True           809        13
AUS      Australia         False           731         9
JAP          Japan         False           588         5
IN           India         False            18         5
RU          Russia          True           200         6
MOR        Morocco          True            70         7
EG           Egypt          True            45         5

In [64]:
#to add a new column named country with terms of column 'country' capitalised 
for lab,rows in cars.iterrows():
    cars.loc[lab,'COUNTRY'] = rows['country'].upper()

In [65]:
cars['COUNTRY'] = cars['country'].apply(str.upper)

In [66]:
cars

           country  drives_right  cars_per_cap  name_len        COUNTRY
US   United States          True           809        13  UNITED STATES
AUS      Australia         False           731         9      AUSTRALIA
JAP          Japan         False           588         5          JAPAN
IN           India         False            18         5          INDIA
RU          Russia          True           200         6         RUSSIA
MOR        Morocco          True            70         7        MOROCCO
EG           Egypt          True            45         5          EGYPT